jmeter-report/statistics.json
{
  "GET All Satellites" : {
    "transaction" : "GET All Satellites",
    "sampleCount" : 12419,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 24.0248812303728,
    "medianResTime" : 21.0,
    "minResTime" : 2.0,
    "maxResTime" : 316.0,
    "pct1ResTime" : 45.0,
    "pct2ResTime" : 55.0,
    "pct3ResTime" : 75.0,
    "throughput" : 207.8563299189931,
    "receivedKBytesPerSec" : 862.186025055232,
    "sentKBytesPerSec" : 33.086505641402226
  },
  "GET Constellation By ID" : {
    "transaction" : "GET Constellation By ID",
    "sampleCount" : 12432,
    "errorCount" : 324,
    "errorPct" : 2.6061776,
    "meanResTime" : 19.8972812097813,
    "medianResTime" : 17.0,
    "minResTime" : 1.0,
    "maxResTime" : 309.0,
    "pct1ResTime" : 40.0,
    "pct2ResTime" : 51.0,
    "pct3ResTime" : 72.0,
    "throughput" : 207.8964531179451,
    "receivedKBytesPerSec" : 51.195936726575695,
    "sentKBytesPerSec" : 34.96692761898192
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 86957,
    "errorCount" : 970,
    "errorPct" : 1.1154939,
    "meanResTime" : 25.94680129259313,
    "medianResTime" : 25.0,
    "minResTime" : 1.0,
    "maxResTime" : 344.0,
    "pct1ResTime" : 50.0,
    "pct2ResTime" : 62.0,
    "pct3ResTime" : 94.0,
    "throughput" : 1450.9761388286333,
    "receivedKBytesPerSec" : 1581.7692418498666,
    "sentKBytesPerSec" : 286.50668618596694
  },
  "Constellation Scenario" : {
    "transaction" : "Constellation Scenario",
    "sampleCount" : 12397,
    "errorCount" : 322,
    "errorPct" : 2.5974026,
    "meanResTime" : 181.56368476244256,
    "medianResTime" : 160.0,
    "minResTime" : 32.0,
    "maxResTime" : 711.0,
    "pct1ResTime" : 341.0,
    "pct2ResTime" : 382.0,
    "pct3ResTime" : 463.0,
    "throughput" : 206.48245307216976,
    "receivedKBytesPerSec" : 1573.9929527577908,
    "sentKBytesPerSec" : 285.39440899873415
  },
  "POST Create Constellation" : {
    "transaction" : "POST Create Constellation",
    "sampleCount" : 12436,
    "errorCount" : 324,
    "errorPct" : 2.6053393,
    "meanResTime" : 27.432132518494793,
    "medianResTime" : 21.0,
    "minResTime" : 2.0,
    "maxResTime" : 342.0,
    "pct1ResTime" : 54.0,
    "pct2ResTime" : 67.0,
    "pct3ResTime" : 98.0,
    "throughput" : 207.5295374140578,
    "receivedKBytesPerSec" : 51.01347774889861,
    "sentKBytesPerSec" : 46.79376102959582
  },
  "GET All Constellations" : {
    "transaction" : "GET All Constellations",
    "sampleCount" : 12439,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 27.15025323579065,
    "medianResTime" : 25.0,
    "minResTime" : 3.0,
    "maxResTime" : 344.0,
    "pct1ResTime" : 48.0,
    "pct2ResTime" : 60.0,
    "pct3ResTime" : 82.0,
    "throughput" : 209.22761219134765,
    "receivedKBytesPerSec" : 476.7680557950111,
    "sentKBytesPerSec" : 34.12208128511236
  },
  "DELETE Satellite" : {
    "transaction" : "DELETE Satellite",
    "sampleCount" : 12408,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.02611218568681,
    "medianResTime" : 22.0,
    "minResTime" : 3.0,
    "maxResTime" : 343.0,
    "pct1ResTime" : 54.0,
    "pct2ResTime" : 67.54999999999927,
    "pct3ResTime" : 91.90999999999985,
    "throughput" : 207.7104642014162,
    "receivedKBytesPerSec" : 20.640130776361385,
    "sentKBytesPerSec" : 38.56131224157557
  },
  "POST Create Satellite" : {
    "transaction" : "POST Create Satellite",
    "sampleCount" : 12426,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.305568968292306,
    "medianResTime" : 22.0,
    "minResTime" : 2.0,
    "maxResTime" : 343.0,
    "pct1ResTime" : 54.0,
    "pct2ResTime" : 67.0,
    "pct3ResTime" : 95.0,
    "throughput" : 207.85868419732023,
    "receivedKBytesPerSec" : 101.64404764891856,
    "sentKBytesPerSec" : 60.468463799116776
  },
  "DELETE Constellation" : {
    "transaction" : "DELETE Constellation",
    "sampleCount" : 12397,
    "errorCount" : 322,
    "errorPct" : 2.5974026,
    "meanResTime" : 26.795757037992985,
    "medianResTime" : 21.0,
    "minResTime" : 1.0,
    "maxResTime" : 320.0,
    "pct1ResTime" : 54.0,
    "pct2ResTime" : 66.0,
    "pct3ResTime" : 89.02000000000044,
    "throughput" : 208.47557386698057,
    "receivedKBytesPerSec" : 25.375696969856218,
    "sentKBytesPerSec" : 39.5427260258135
  }
}